/*–еализуйте метод:
public static String collectBirthdays(int year, int month, int day),

который вернЄт строки, содержащие все ваши прошедшие дни рождени€ от момента
рождени€ до текущей даты в требуемом формате. ƒата рождени€ передаЄтс€ в метод трем€ числами.

‘ормат требуемого вывода, если ваш день рождени€ Ч 31 декабр€ 1990 года, а сейчас Ч 1 апрел€ 2022 года:
0 - 31.12.1990 - Mon
1 - 31.12.1991 - Tue
2 - 31.12.1992 - Thu
—оздайте в начале метода две переменные класса LocalDate: birthday и today.
ѕосле этого напишите цикл, в котором добавл€йте один год к birthday и сравнивайте
получившуюс€ дату с сегодн€шней, использу€ метод isAfter или isBefore. “аким образом у
вас будет провер€тьс€ не только год, но и день, что позволит точно выводить данные о прошедших дн€х рождени€х.
ƒл€ переноса текста на новую строку используйте символ переноса строки, который
возвращаетс€ методом System.lineSeparator():
String text = text + "—трока с датой" +

System.lineSeparator();

Ётот метод возвращает системный перенос строки Ч тот, который используетс€ в вашей операционной системе по умолчанию. ¬ Windows это \r\n, в MacOS и Linux Ч \n.
 */
public class Date {



}
